import mirzaAbdollahImage from "/images/_275b06e1-0565-4c13-adab-f9452d71c969.jpg";
import mirzadehEshqiImage from "/images/_950ed168-af6c-4d93-ac99-6a74ab906b1c.jpg";
import ibnSinaImage from "/images/_5569b17a-542a-433d-9917-652de1bba8be.jpg";
import aarefGhazviniImage from "/images/_739b6569-d658-49a2-a925-7220d5b5c721.jpg";

export const CELEBRITYS_INFORMATIONS_DATA = [
  {
    name: "باباطاهر",
    introduction:
      'میرزا عبدالله، مشهور به باباطاهر، شاعر بزرگ ایرانی از دوران صفویه و معاصر شاعرانی چون حافظ و سعدی بوده است. وی اهل شهر همدان بوده و در قرن شانزدهم میلادی زندگی می‌کرد. نام اصلی او، "میرزا عبدالله" بوده که به خاطر دست‌آوردهای عارفانه و شعری‌اش، به لقب "باباطاهر" شهرت یافت.\n\nباباطاهر به شعر غزل و اشعار عارفانه معروف است و آثار او به زبان فارسی نوشته شده‌اند. شعرهای او از مضمون‌های مختلفی چون محبت الهی، عشق و وحدت الهی، تذکر و موعظه دینی، احوال و اختلالات انسانی، تأمل در طبیعت و... الهام گرفته‌اند.\n\nباباطاهر از زبان ساده و روان برخوردار بوده و در اشعار خود از تصاویر زیبا و متنوع استفاده می‌کرده است. وی در شعرهای خود به ترسیم زندگی روحی و عاشقانه پرداخته و اغلب از عبارات مجاز و ستایش الهی برای ابراز احساسات خود استفاده کرده است.\n\nآثار باباطاهر عمدتاً در دیوانه‌ها و مجموعه‌های شعر مختلف جمع‌آوری شده‌اند. او به عنوان یکی از شاعران مهم دوره صفویه و یکی از پیشوایان ادبی ایران محسوب می‌شود و اشعار او هنوز هم مورد توجه علاقه‌مندان به ادبیات فارسی قرار دارند.',
    image: mirzaAbdollahImage,
    id: 1,
  },
  {
    name: "میرزاده عشقی",
    introduction:
      'میرزاده عشقی، شاعر و نویسنده ایرانی از شهر همدان بوده و در قرن نوزدهم میلادی زندگی کرده است. او به عنوان یکی از شاعران مشهور دوره قاجار شناخته می‌شود و آثار او بیشتر در زمینهٔ شعر غزل و حدیث نثری قرار دارد.\n\nعشقی به خاطر سبک زیبا و عاطفی شعرهایش شناخته می‌شود. او از اصول عرفانی و اسلامی الهام گرفته و اشعارش غالباً شامل موضوعات مذهبی، عشق الهی، و مسائل اخلاقی است. سبک ادبی او اغلب با لغت‌ها و اصطلاحات پرکاربرد فارسی و به زبان ساده و روان مشخص می‌شود.\n\nآثار معروف میرزاده عشقی شامل دیوان شعر و اشعار توفیقات (تفضیلات) است. او با نام‌های مختلفی همچون "میرزا محمد حسین" و "میرزا محمدحسن" نیز شناخته می‌شود.\n\nموضوعات اصلی شعرهای عشقی شامل حسرت، شوق، عشق، و پیشوایی معنوی است. شعرهای او عمدتاً در باب عشق الهی و عشق به امام حسین (علیه‌السلام) و اهل بیت پیامبر اسلام (صلی‌الله‌علیه‌وآله) به تصویر کشیده شده است.',
    image: mirzadehEshqiImage,
    id: 2,
  },
  {
    name: "بوعلی سینا",
    introduction:
      'بوعلی سینا، مشهور به ابن سینا، پزشک، فیلسوف، عالم و شاعر ایرانی-اسلامی بوده و از نخستین و مهم‌ترین پزشکان و فیلسوفان اسلامی محسوب می‌شود. او در دورهٔ اسلامی معصومه، در سال 980 میلادی در خرمشهر (که امروزه به نام همدان شناخته می‌شود) به دنیا آمد. ابن سینا به عنوان "حکیم اول" (الحکیم الأول) یا "شیخ الرئیس" نیز شناخته می‌شود.\n\nگرچه ابن سینا به عنوان یکی از بزرگترین پزشکان و فیلسوفان تاریخ اسلام شناخته می‌شود، اما اشعار نیز به عنوان یک شاعر نخستین کهنهٔ ادب فارسی در دسترس است. او در بحر متنوعی از اشعار خود از موضوعات عارفانه و فلسفی گرفته تا اشعار محبوب و جشن‌ها استفاده کرده است.\n\nابن سینا در شعرهای خود به عشق و معنویت اشاره می‌کند. او از عبارات پرمعنی و اصطلاحات فلسفی در اشعار خود بهره گرفته و از زبان سلیس و زیبای فارسی استفاده نموده است. اشعار ابن سینا بیشتر در دیوان "شاهنامهٔ ابن سینا" جمع‌آوری شده‌اند که شامل شعرها و قطعات مختلفی از وی است.\n\nتأثیر ابن سینا در ادبیات فارسی و ادبیات جهانی بسیار بزرگ است و او به عنوان یکی از آثار برجستهٔ ادبیات و تمدن اسلامی شناخته می‌شود. اشعار و آثار ادبی ابن سینا همچنان جایگاه ویژه‌ای در میراث ادبی و فرهنگی ایران دارند.',
    image: ibnSinaImage,
    id: 3,
  },
  {
    name: "ابوالقاسم عارف قزوینی",
    introduction:
      'ابوالقاسم عارف قزوینی مشهور به «عارف قزوینی» در سال ۱۲۵۹ شمسی در قزوین به دنیا آمد. او در جوانی صرف و نحو زبان‌های فارسی و عربی را به‌طور کامل یاد گرفت و به ادبیات و شعر علاقه زیادی نشان ‌داد.\n\nاو در زمینه موسیقی شاگرد میرزا صادق خرازی بود. مدتی نیز به‌دلیل اصرار‌های پدرش، ملا هادی وکیل، پیش یکی از واعظان قزوین نوحه‌خوانی می‌کرد و عمامه به سر می‌گذاشت. او سپس به تهران مهاجرت کرد و به‌دلیل نبوغ فوق‌العاده‌ای که در زمینه شعر و موسیقی داشت، به‌سرعت وارد دربار قاجار شد و با شاهزادگان قاجار آشنایی پیدا کرد.\n\nاو در ابتدا مورد توجه شاهزاده وثوق الدوله قرار گرفت و مدتی در دربار او خدمت می‌کرد. او درباره وضعیت خود در این مدت می‌نویسد:\n\n"در این مدت یک سال و اندی، حتی یک شب آسایش نداشتم و در صف سفره نشینان و مفت خوران از همه سربلند‌تر محسوب می‌شدم."\n\nسپس مظفرالدین شاه از صدای عارف خوشش می‌آید و او را به دربارش می‌آورد؛ او را به‌عنوان فراش خلوت خود استخدام می‌کند؛ اما عارف که از انجام این کار بیزار بود، با وجود اینکه نیاز مالی داشت و می‌توانست با این کار از لحاظ مادی تامین شود، این پیشنهاد را رد کرد و به قزوین بازگشت. دراین‌باره نیز او می‌نویسد:\n\n"من همیشه خواهان حیثیت و شرافت بوده‌ام و حتی دوستان نزدیک نیز جرات تعارف چنین چیزی را به من نداشتند."',
    image: aarefGhazviniImage,
    id: 4,
  },
];
